OdDAI.Boolean.toStr
\details
Converts the Boolean object value into an ANSI string.
\returns An ANSI string that matches the Boolean object value.

OdDAI.Boolean.op_LogicalOr(OdDAI.Boolean!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Operator that implements the logical OR operation (C++ "||" operator) for the Boolean data type.
\param other [in] Another Boolean value (right-hand of the logical AND operation).
\returns A Boolean value that is the result of the operation.

OdDAI.Boolean.op_Assign(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator for the Boolean data type.
The operator casts specified ANSI string
to the Boolean value and assigns it to the object.
\param val [in] An ANSI string to be assigned (a right-hand operand of the assignment operation).
\returns The reference to the Boolean object modified by the assignment operation.
\remarks
The specified ANSI string should be:
* "F" to set the Boolean object to the False value.
* "T" to set the Boolean object to the True value.
In all other cases, the operator makes the Boolean object unset.

OdDAI.Boolean.op_Assign(System.Int32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst)
\details
Assignment operator for the Boolean data type.
The operator casts specified signed long value to the Boolean value and assigns it to the object.
\param val [in] A signed long data type value to be assigned (a right-hand operand of the assignment operation).
\returns The reference to the Boolean object modified by the assignment operation.

OdDAI.Boolean.#ctor(OdDAI.Boolean_)
\details
Creates a new Boolean object with a specified value.
\param val [in] An initial value of the created Boolean object.

OdDAI.Boolean.#ctor
\details
Creates a new Boolean object with an unset value.

OdDAI.Boolean
\details
A class that represents the SDAI primitive Boolean data type.